; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l15_p15_c15_g15)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-person person1 refugio8)
	(at-person person2 refugio14)
	(at-person person3 refugio5)
	(at-person person4 refugio4)
	(at-person person5 refugio11)
	(at-person person6 refugio11)
	(at-person person7 refugio11)
	(at-person person8 refugio13)
	(at-person person9 refugio10)
	(at-person person10 refugio9)
	(at-person person11 refugio12)
	(at-person person12 refugio5)
	(at-person person13 refugio8)
	(at-person person14 refugio7)
	(at-person person15 refugio4)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person3 comida)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person12 comida)
	(person-has person13 medicina)
	(person-has person15 comida)
	(person-has person15 medicina)
))
)

; plan
1. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 0 of 15
2. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 0 of 15
3. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 0 of 15
4. (leave box11 refugio14 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio14) (free dron1-der) (person-has person2 comida)
   goals met: 1 of 15
5. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 1 of 15
6. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 1 of 15
7. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 1 of 15
8. (move refugio11 refugio13 dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 refugio13)
   goals met: 1 of 15
9. (leave box10 refugio13 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio13) (free dron1-der) (person-has person8 comida)
   goals met: 2 of 15
10. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 2 of 15
11. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 2 of 15
12. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 2 of 15
13. (move refugio11 refugio10 dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 refugio10)
   goals met: 2 of 15
14. (leave box9 refugio10 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio10) (free dron1-der) (person-has person9 comida)
   goals met: 3 of 15
15. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 3 of 15
16. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 3 of 15
17. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 3 of 15
18. (move refugio11 refugio9 dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 refugio9)
   goals met: 3 of 15
19. (leave box8 refugio9 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio9) (free dron1-der) (person-has person10 comida)
   goals met: 4 of 15
20. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 4 of 15
21. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 4 of 15
22. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 4 of 15
23. (leave box7 refugio11 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio11) (free dron1-der) (person-has person6 comida)
   goals met: 5 of 15
24. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 5 of 15
25. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 5 of 15
26. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 5 of 15
27. (leave box6 refugio11 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio11) (free dron1-der) (person-has person7 comida)
   goals met: 6 of 15
28. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 6 of 15
29. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 6 of 15
30. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 6 of 15
31. (leave box5 refugio5 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio5) (free dron1-der) (person-has person3 comida)
   goals met: 7 of 15
32. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 7 of 15
33. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 7 of 15
34. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 7 of 15
35. (leave box15 refugio5 dron1-izq dron1 person3 medicina)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 medicina)
   added: (at-box box15 refugio5) (free dron1-izq) (person-has person3 medicina)
   goals met: 8 of 15
36. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 8 of 15
37. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 8 of 15
38. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 8 of 15
39. (leave box4 refugio5 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio5) (free dron1-der) (person-has person12 comida)
   goals met: 9 of 15
40. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 9 of 15
41. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 9 of 15
42. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 9 of 15
43. (leave box3 refugio8 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio8) (free dron1-der) (person-has person1 comida)
   goals met: 10 of 15
44. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 10 of 15
45. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 10 of 15
46. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 10 of 15
47. (leave box14 refugio8 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 medicina)
   added: (at-box box14 refugio8) (free dron1-izq) (person-has person13 medicina)
   goals met: 11 of 15
48. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 11 of 15
49. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 11 of 15
50. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 11 of 15
51. (leave box2 refugio4 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio4) (free dron1-der) (person-has person4 comida)
   goals met: 12 of 15
52. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 12 of 15
53. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 12 of 15
54. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 12 of 15
55. (leave box1 refugio4 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio4) (free dron1-der) (person-has person15 comida)
   goals met: 13 of 15
56. (leave box13 refugio4 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 medicina)
   added: (at-box box13 refugio4) (free dron1-izq) (person-has person4 medicina)
   goals met: 14 of 15
57. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 14 of 15
58. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 14 of 15
59. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 14 of 15
60. (leave box12 refugio4 dron1-der dron1 person15 medicina)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 medicina)
   added: (at-box box12 refugio4) (free dron1-der) (person-has person15 medicina)
   goals met: 15 of 15
